[
    {
      "title": "Inception",
      "year": 2010,
      "genre": "Science Fiction",
      "director": "Christopher Nolan",
      "rating": 8.8,
      "short_description": "A mind-bending thriller.",
      "long_description": "Inception (2010), directed by Christopher Nolan, is a visually stunning sci-fi thriller exploring the nature of dreams and reality. Dom Cobb (Leonardo DiCaprio) is a skilled thief who enters people's dreams to steal valuable secrets. Cobb is given a chance to erase his criminal past if he can successfully perform an inception—planting an idea into someone's subconscious. As he and his team navigate the labyrinth of dreams within dreams, they encounter escalating dangers and confront Cobb’s own unresolved issues. The film intricately weaves action, psychological depth, and innovative visuals, leaving audiences questioning the boundaries between reality and illusion.",
      "image_path": "images/inception.jpg"
    },
    {
      "title": "The Dark Knight",
      "year": 2008,
      "genre": "Action",
      "director": "Christopher Nolan",
      "rating": 9.0,
      "short_description": "The battle for Gotham.",
      "long_description": "The Dark Knight (2008), directed by Christopher Nolan, is a critically acclaimed superhero film and the second installment in Nolan's Batman trilogy. The film features Christian Bale as Batman, who faces his most formidable adversary, the Joker, played by Heath Ledger in an iconic performance. The Joker, a chaotic villain with a plan to undermine Gotham City's moral fabric, forces Batman to confront his own principles and the fine line between justice and vigilantism. As the city descends into chaos, Batman grapples with ethical dilemmas and personal sacrifice. The film is renowned for its intense action sequences, complex characters, and a compelling narrative that explores themes of heroism and corruption.",
      "image_path": "images/the_dark_knight.jpg"
    },
    {
      "title": "Interstellar",
      "year": 2014,
      "genre": "Adventure",
      "director": "Christopher Nolan",
      "rating": 8.6,
      "short_description": "A journey beyond the stars.",
      "long_description": "Interstellar (2014), directed by Christopher Nolan, is a visually breathtaking and emotionally profound sci-fi epic. The film follows Cooper (Matthew McConaughey), a pilot and engineer who joins a mission through a wormhole near Saturn to find a new habitable planet for humanity. As Earth faces ecological collapse, Cooper and his team confront the challenges of space travel, time dilation, and the human spirit. The narrative intertwines scientific concepts with personal sacrifice and love, while Hans Zimmer’s evocative score enhances the film’s emotional depth. Interstellar explores themes of survival, exploration, and the enduring connection between parents and children.",
      "image_path": "images/interstellar.jpg"
    },
    {
      "title": "The Matrix",
      "year": 1999,
      "genre": "Science Fiction",
      "director": "Lana Wachowski, Lilly Wachowski",
      "rating": 8.7,
      "short_description": "Reality is an illusion.",
      "long_description": "The Matrix (1999): Directed by the Wachowskis, The Matrix is a groundbreaking sci-fi action film starring Keanu Reeves as Neo, a hacker who discovers that reality as he knows it is a simulated world created by intelligent machines. As he joins a rebellion against the machines, Neo learns to manipulate the matrix's rules and faces profound questions about free will, reality, and human potential. The film is renowned for its innovative visual effects, including the iconic bullet time sequences, and its philosophical depth..",
      "image_path": "images/the_matrix.jpg"
    },
    {
      "title": "Gladiator",
      "year": 2000,
      "genre": "Action",
      "director": "Ridley Scott",
      "rating": 8.5,
      "short_description": "A tale of revenge and honor.",
      "long_description": "Gladiator (2000): Directed by Ridley Scott, Gladiator stars Russell Crowe as Maximus, a betrayed Roman general who becomes a gladiator seeking vengeance against the corrupt emperor Commodus (Joaquin Phoenix). Set in ancient Rome, the film combines epic battles, political intrigue, and personal redemption. With its gripping storyline, impressive set pieces, and a powerful performance by Crowe, Gladiator explores themes of honor, revenge, and the struggle for freedom.",
      "image_path": "images/gladiator.jpg"
    },
    {
      "title": "The Shawshank Redemption",
      "year": 1994,
      "genre": "Drama",
      "director": "Frank Darabont",
      "rating": 9.3,
      "short_description": "Hope can set you free.",
      "long_description": "The Shawshank Redemption (1994): Directed by Frank Darabont and based on a Stephen King novella, The Shawshank Redemption stars Tim Robbins as Andy Dufresne, a banker wrongfully imprisoned for murder. Through his enduring spirit and intelligence, Andy forms an unlikely friendship with fellow inmate Red (Morgan Freeman) and transforms the bleak Shawshank prison from within. The film is celebrated for its powerful storytelling, themes of hope and redemption, and exceptional performances.",
      "image_path": "images/shawshank_redemption.jpg"
    },
    {
      "title": "Pulp Fiction",
      "year": 1994,
      "genre": "Crime",
      "director": "Quentin Tarantino",
      "rating": 8.9,
      "short_description": "A tapestry of crime stories.",
      "long_description": "Pulp Fiction (1994): Directed by Quentin Tarantino, Pulp Fiction is a highly influential crime film known for its non-linear narrative and sharp dialogue. The film intertwines multiple storylines involving hitmen Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson), a gangster's wife (Uma Thurman), and a pair of armed robbers. Its eclectic mix of humor, violence, and pop culture references, along with memorable performances, make it a seminal work in modern cinema.",
      "image_path": "images/pulp_fiction.jpg"
    },
    {
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "year": 2001,
      "genre": "Fantasy",
      "director": "Peter Jackson",
      "rating": 8.8,
      "short_description": "The journey begins.",
      "long_description": "The Lord of the Rings: The Fellowship of the Ring (2001): Directed by Peter Jackson, this epic fantasy film is the first installment in the Lord of the Rings trilogy, based on J.R.R. Tolkien's novel. The film follows Frodo Baggins (Elijah Wood) and a diverse group of allies as they embark on a quest to destroy the One Ring and thwart the dark lord Sauron. With its expansive world-building, rich storytelling, and stunning visual effects, it sets the stage for an epic saga of adventure and heroism.",
      "image_path": "images/fellowship_of_the_ring.jpg"
    },
    {
      "title": "Forrest Gump",
      "year": 1994,
      "genre": "Drama",
      "director": "Robert Zemeckis",
      "rating": 8.8,
      "short_description": "Life is like a box of chocolates.",
      "long_description": "The story of an intellectually disabled man's life and his accidental involvement in some of the defining events of the late 20th century.",
      "image_path": "images/forrest_gump.jpg"
    },
    {
      "title": "Fight Club",
      "year": 1999,
      "genre": "Drama",
      "director": "David Fincher",
      "rating": 8.8,
      "short_description": "First rule: You do not talk about Fight Club.",
      "long_description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
      "image_path": "images/fight_club.jpg"
    },
    {
      "title": "Inglourious Basterds",
      "year": 2009,
      "genre": "War",
      "director": "Quentin Tarantino",
      "rating": 8.3,
      "short_description": "A tale of vengeance and bravery.",
      "long_description": "In Nazi-occupied France, a group of Jewish-American soldiers known as 'The Basterds' engage in targeted acts of retribution against the Third Reich.",
      "image_path": "images/inglourious_basterds.jpg"
    },
    {
      "title": "The Prestige",
      "year": 2006,
      "genre": "Mystery",
      "director": "Christopher Nolan",
      "rating": 8.5,
      "short_description": "A rivalry of magic and obsession.",
      "long_description": "Two rival magicians compete to create the ultimate stage illusion, leading to dangerous consequences.",
      "image_path": "images/the_prestige.jpg"
    },
    {
      "title": "Titanic",
      "year": 1997,
      "genre": "Romance",
      "director": "James Cameron",
      "rating": 7.8,
      "short_description": "A timeless love story.",
      "long_description": "Titanic (1997): Directed by James Cameron, Titanic is an epic romance and disaster film set aboard the ill-fated RMS Titanic. The story follows Jack Dawson (Leonardo DiCaprio) and Rose DeWitt Bukater (Kate Winslet), two passengers from different social backgrounds who fall in love as the ship tragically sinks. The film combines historical events with a sweeping love story, and its groundbreaking visual effects and memorable soundtrack have made it one of the highest-grossing films of all time.",
      "image_path": "images/titanic.jpg"
    },
    {
      "title": "Jurassic Park",
      "year": 1993,
      "genre": "Adventure",
      "director": "Steven Spielberg",
      "rating": 8.1,
      "short_description": "Dinosaurs live again.",
      "long_description": "During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.",
      "image_path": "images/jurassic_park.jpg"
    },
    {
      "title": "The Lion King",
      "year": 1994,
      "genre": "Animation",
      "director": "Roger Allers, Rob Minkoff",
      "rating": 8.5,
      "short_description": "A king's journey to reclaim his throne.",
      "long_description": "Lion cub and future king Simba searches for his identity, learning lessons of responsibility and bravery along the way.",
      "image_path": "images/the_lion_king.jpg"
    },
    {
      "title": "Back to the Future",
      "year": 1985,
      "genre": "Science Fiction",
      "director": "Robert Zemeckis",
      "rating": 8.5,
      "short_description": "Time travel adventure.",
      "long_description": "A teenager travels back in time to meet his parents in high school, accidentally changing history in the process.",
      "image_path": "images/back_to_the_future.jpg"
    },
    {
      "title": "The Terminator",
      "year": 1984,
      "genre": "Action",
      "director": "James Cameron",
      "rating": 8.0,
      "short_description": "A fight for the future.",
      "long_description": "A cyborg assassin is sent back in time to kill a woman whose son will lead humanity in a war against machines.",
      "image_path": "images/the_terminator.jpg"
    },
    {
      "title": "The Godfather",
      "year": 1972,
      "genre": "Crime",
      "director": "Francis Ford Coppola",
      "rating": 9.2,
      "short_description": "The rise of a mafia family.",
      "long_description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
      "image_path": "images/the_godfather.jpg"
    },
    {
      "title": "The Godfather: Part II",
      "year": 1974,
      "genre": "Crime",
      "director": "Francis Ford Coppola",
      "rating": 9.0,
      "short_description": "The continuing saga of the Corleone family.",
      "long_description": "The early life and career of Vito Corleone in 1920s New York is portrayed, while his son Michael expands and tightens his grip on the family crime syndicate.",
      "image_path": "images/the_godfather_part_ii.jpg"
    },
    {
      "title": "Star Wars: Episode IV - A New Hope",
      "year": 1977,
      "genre": "Science Fiction",
      "director": "George Lucas",
      "rating": 8.6,
      "short_description": "The beginning of a galactic saga.",
      "long_description": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, and two droids to save the galaxy from the Empire's world-destroying battle station.",
      "image_path": "images/star_wars_a_new_hope.jpg"
    }
  ]
  